depletionmode/cupc8/emu/rp2040/src/cortex-m0-core.cpp
// Port of rp2040js src/cortex-m0-core.ts
//
// STUB: every body below still has to be ported from the TS shown in its
// comment (see README.md, "Porting rules"). Bus-facing methods abort so that
// firmware cannot run on a half-ported peripheral without noticing.
#include "cortex-m0-core.h"

#include "rp2040.h"
#include "utils/logging.h"
#include "utils/js.h"

namespace rp2040js {

CortexM0Core::CortexM0Core(RP2040 &rp2040) : rp2040(rp2040) {
  // TODO(port): cortex-m0-core.ts
  //   constructor(readonly rp2040: RP2040) {
  //     this.SP = 0xfffffffc;
  //     this.bankedSP = 0xfffffffc;
  //   }
}

Logger &CortexM0Core::logger() {
  // TODO(port): cortex-m0-core.ts
  //   get logger() {
  //     return this.rp2040.logger;
  //   }
  return *rp2040.logger;
}

void CortexM0Core::reset() {
  // TODO(port): cortex-m0-core.ts
  //   reset() {
  //     this.SP = this.rp2040.readUint32(this.VTOR);
  //     this.PC = this.rp2040.readUint32(this.VTOR + 4) & 0xfffffffe;
  //     this.cycles = 0;
  //   }
}

uint32_t CortexM0Core::APSR() const {
  // TODO(port): cortex-m0-core.ts
  //   get APSR() {
  //     return (
  //       (this.N ? 0x80000000 : 0) |
  //       (this.Z ? 0x40000000 : 0) |
  //       (this.C ? 0x20000000 : 0) |
  //       (this.V ? 0x10000000 : 0)
  //     );
  //   }
  return 0;
}

void CortexM0Core::setAPSR(uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   set APSR(value: number) {
  //     this.N = !!(value & 0x80000000);
  //     this.Z = !!(value & 0x40000000);
  //     this.C = !!(value & 0x20000000);
  //     this.V = !!(value & 0x10000000);
  //   }
  (void)value;
}

uint32_t CortexM0Core::xPSR() const {
  // TODO(port): cortex-m0-core.ts
  //   get xPSR() {
  //     return this.APSR | this.IPSR | (1 << 24);
  //   }
  return 0;
}

void CortexM0Core::setXPSR(uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   set xPSR(value: number) {
  //     this.APSR = value;
  //     this.IPSR = value & 0x3f;
  //   }
  (void)value;
}

bool CortexM0Core::checkCondition(uint32_t cond) const {
  // TODO(port): cortex-m0-core.ts
  //   checkCondition(cond: number) {
  //     // Evaluate base condition.
  //     let result = false;
  //     switch (cond >> 1) {
  //       case 0b000:
  //         result = this.Z;
  //         break;
  //       case 0b001:
  //         result = this.C;
  //         break;
  //       case 0b010:
  //         result = this.N;
  //         break;
  //       case 0b011:
  //         result = this.V;
  //         break;
  //       case 0b100:
  //         result = this.C && !this.Z;
  //         break;
  //       case 0b101:
  //         result = this.N === this.V;
  //         break;
  //       case 0b110:
  //         result = this.N === this.V && !this.Z;
  //         break;
  //       case 0b111:
  //         result = true;
  //         break;
  //     }
  //     return cond & 0b1 && cond != 0b1111 ? !result : result;
  //   }
  (void)cond;
  return false;
}

uint32_t CortexM0Core::readUint32(uint32_t address) {
  // TODO(port): cortex-m0-core.ts
  //   readUint32(address: number) {
  //     return this.rp2040.readUint32(address);
  //   }
  (void)address;
  return 0;
}

uint32_t CortexM0Core::readUint16(uint32_t address) {
  // TODO(port): cortex-m0-core.ts
  //   readUint16(address: number) {
  //     return this.rp2040.readUint16(address);
  //   }
  (void)address;
  return 0;
}

uint32_t CortexM0Core::readUint8(uint32_t address) {
  // TODO(port): cortex-m0-core.ts
  //   readUint8(address: number) {
  //     return this.rp2040.readUint8(address);
  //   }
  (void)address;
  return 0;
}

void CortexM0Core::writeUint32(uint32_t address, uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   writeUint32(address: number, value: number) {
  //     this.rp2040.writeUint32(address, value);
  //   }
  (void)address;
  (void)value;
}

void CortexM0Core::writeUint16(uint32_t address, uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   writeUint16(address: number, value: number) {
  //     this.rp2040.writeUint16(address, value);
  //   }
  (void)address;
  (void)value;
}

void CortexM0Core::writeUint8(uint32_t address, uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   writeUint8(address: number, value: number) {
  //     this.rp2040.writeUint8(address, value);
  //   }
  (void)address;
  (void)value;
}

void CortexM0Core::switchStack(StackPointerBank stack) {
  // TODO(port): cortex-m0-core.ts
  //   switchStack(stack: StackPointerBank) {
  //     if (this.SPSEL !== stack) {
  //       const temp = this.SP;
  //       this.SP = this.bankedSP;
  //       this.bankedSP = temp;
  //       this.SPSEL = stack;
  //     }
  //   }
  (void)stack;
}

uint32_t CortexM0Core::SPprocess() const {
  // TODO(port): cortex-m0-core.ts
  //   get SPprocess() {
  //     return this.SPSEL === StackPointerBank.SPprocess ? this.SP : this.bankedSP;
  //   }
  return 0;
}

void CortexM0Core::setSPprocess(uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   set SPprocess(value: number) {
  //     if (this.SPSEL === StackPointerBank.SPprocess) {
  //       this.SP = value;
  //     } else {
  //       this.bankedSP = value >>> 0;
  //     }
  //   }
  (void)value;
}

uint32_t CortexM0Core::SPmain() const {
  // TODO(port): cortex-m0-core.ts
  //   get SPmain() {
  //     return this.SPSEL === StackPointerBank.SPmain ? this.SP : this.bankedSP;
  //   }
  return 0;
}

void CortexM0Core::setSPmain(uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   set SPmain(value: number) {
  //     if (this.SPSEL === StackPointerBank.SPmain) {
  //       this.SP = value;
  //     } else {
  //       this.bankedSP = value >>> 0;
  //     }
  //   }
  (void)value;
}

void CortexM0Core::exceptionEntry(uint32_t exceptionNumber) {
  // TODO(port): cortex-m0-core.ts
  //   exceptionEntry(exceptionNumber: number) {
  //     // PushStack:
  //     let framePtr = 0;
  //     let framePtrAlign = 0;
  //     if (this.SPSEL && this.currentMode === ExecutionMode.Mode_Thread) {
  //       framePtrAlign = this.SPprocess & 0b100 ? 1 : 0;
  //       this.SPprocess = (this.SPprocess - 0x20) & ~0b100;
  //       framePtr = this.SPprocess;
  //     } else {
  //       framePtrAlign = this.SPmain & 0b100 ? 1 : 0;
  //       this.SPmain = (this.SPmain - 0x20) & ~0b100;
  //       framePtr = this.SPmain;
  //     }
  //     /* only the stack locations, not the store order, are architected */
  //     this.writeUint32(framePtr, this.registers[0]);
  //     this.writeUint32(framePtr + 0x4, this.registers[1]);
  //     this.writeUint32(framePtr + 0x8, this.registers[2]);
  //     this.writeUint32(framePtr + 0xc, this.registers[3]);
  //     this.writeUint32(framePtr + 0x10, this.registers[12]);
  //     this.writeUint32(framePtr + 0x14, this.LR);
  //     this.writeUint32(framePtr + 0x18, this.PC & ~1); // ReturnAddress(ExceptionType);
  //     this.writeUint32(framePtr + 0x1c, (this.xPSR & ~(1 << 9)) | (framePtrAlign << 9));
  //     if (this.currentMode == ExecutionMode.Mode_Handler) {
  //       this.LR = 0xfffffff1;
  //     } else {
  //       if (!this.SPSEL) {
  //         this.LR = 0xfffffff9;
  //       } else {
  //         this.LR = 0xfffffffd;
  //       }
  //     }
  //     // ExceptionTaken:
  //     this.currentMode = ExecutionMode.Mode_Handler; // Enter Handler Mode, now Privileged
  //     this.IPSR = exceptionNumber;
  //     this.switchStack(StackPointerBank.SPmain);
  //     this.eventRegistered = true;
  //     const vectorTable = this.VTOR;
  //     this.PC = this.readUint32(vectorTable + 4 * exceptionNumber);
  //   }
  (void)exceptionNumber;
}

void CortexM0Core::exceptionReturn(uint32_t excReturn) {
  // TODO(port): cortex-m0-core.ts
  //   exceptionReturn(excReturn: number) {
  //     let framePtr = this.SPmain;
  //     switch (excReturn & 0xf) {
  //       case 0b0001: // Return to Handler
  //         this.currentMode = ExecutionMode.Mode_Handler;
  //         this.switchStack(StackPointerBank.SPmain);
  //         break;
  //       case 0b1001: // Return to Thread using Main stack
  //         this.currentMode = ExecutionMode.Mode_Thread;
  //         this.switchStack(StackPointerBank.SPmain);
  //         break;
  //       case 0b1101: // Return to Thread using Process stack
  //         framePtr = this.SPprocess;
  //         this.currentMode = ExecutionMode.Mode_Thread;
  //         this.switchStack(StackPointerBank.SPprocess);
  //         break;
  //       // Assigning CurrentMode to Mode_Thread causes a drop in privilege
  //       // if CONTROL.nPRIV is set to 1
  //     }
  //
  //     // PopStack:
  //     this.registers[0] = this.readUint32(framePtr); // Stack accesses are performed as Unprivileged accesses if
  //     this.registers[1] = this.readUint32(framePtr + 0x4); // CONTROL<0>=='1' && EXC_RETURN<3>=='1' Privileged otherwise
  //     this.registers[2] = this.readUint32(framePtr + 0x8);
  //     this.registers[3] = this.readUint32(framePtr + 0xc);
  //     this.registers[12] = this.readUint32(framePtr + 0x10);
  //     this.LR = this.readUint32(framePtr + 0x14);
  //     this.PC = this.readUint32(framePtr + 0x18);
  //     const psr = this.readUint32(framePtr + 0x1c);
  //
  //     const framePtrAlign = psr & (1 << 9) ? 0b100 : 0;
  //
  //     switch (excReturn & 0xf) {
  //       case 0b0001: // Returning to Handler mode
  //         this.SPmain = (this.SPmain + 0x20) | framePtrAlign;
  //         break;
  //
  //       case 0b1001: // Returning to Thread mode using Main stack
  //         this.SPmain = (this.SPmain + 0x20) | framePtrAlign;
  //         break;
  //
  //       case 0b1101: // Returning to Thread mode using Process stack
  //         this.SPprocess = (this.SPprocess + 0x20) | framePtrAlign;
  //         break;
  //     }
  //
  //     this.APSR = psr & 0xf0000000;
  //     const forceThread = this.currentMode == ExecutionMode.Mode_Thread && this.nPRIV;
  //     this.IPSR = forceThread ? 0 : psr & 0x3f;
  //     this.interruptsUpdated = true;
  //     // Thumb bit should always be one! EPSR<24> = psr<24>; // Load valid EPSR bits from memory
  //     this.eventRegistered = true;
  //     // if CurrentMode == Mode_Thread && SCR.SLEEPONEXIT == '1' then
  //     // SleepOnExit(); // IMPLEMENTATION DEFINED
  //   }
  (void)excReturn;
}

uint32_t CortexM0Core::pendSVPriority() const {
  // TODO(port): cortex-m0-core.ts
  //   get pendSVPriority() {
  //     return (this.SHPR3 >> 22) & 0x3;
  //   }
  return 0;
}

