depletionmode/cupc8/emu/rp2040/src/cortex-m0-core.cpp
uint32_t CortexM0Core::svCallPriority() const {
  // TODO(port): cortex-m0-core.ts
  //   get svCallPriority() {
  //     return this.SHPR2 >>> 30;
  //   }
  return 0;
}

uint32_t CortexM0Core::systickPriority() const {
  // TODO(port): cortex-m0-core.ts
  //   get systickPriority() {
  //     return this.SHPR3 >>> 30;
  //   }
  return 0;
}

int32_t CortexM0Core::exceptionPriority(uint32_t n) const {
  // TODO(port): cortex-m0-core.ts
  //   exceptionPriority(n: number) {
  //     switch (n) {
  //       case EXC_RESET:
  //         return -3;
  //       case EXC_NMI:
  //         return -2;
  //       case EXC_HARDFAULT:
  //         return -1;
  //       case EXC_SVCALL:
  //         return this.svCallPriority;
  //       case EXC_PENDSV:
  //         return this.pendSVPriority;
  //       case EXC_SYSTICK:
  //         return this.systickPriority;
  //       default: {
  //         if (n < 16) {
  //           return LOWEST_PRIORITY;
  //         }
  //         const intNum = n - 16;
  //         for (let priority = 0; priority < 4; priority++) {
  //           if (this.interruptPriorities[priority] & (1 << intNum)) {
  //             return priority;
  //           }
  //         }
  //         return LOWEST_PRIORITY;
  //       }
  //     }
  //   }
  (void)n;
  return 0;
}

uint32_t CortexM0Core::vectPending() const {
  // TODO(port): cortex-m0-core.ts
  //   get vectPending() {
  //     if (this.pendingNMI) {
  //       return EXC_NMI;
  //     }
  //     const { svCallPriority, systickPriority, pendSVPriority, pendingInterrupts } = this;
  //     for (let priority = 0; priority < LOWEST_PRIORITY; priority++) {
  //       const levelInterrupts = pendingInterrupts & this.interruptPriorities[priority];
  //       if (this.pendingSVCall && priority === svCallPriority) {
  //         return EXC_SVCALL;
  //       }
  //       if (this.pendingPendSV && priority === pendSVPriority) {
  //         return EXC_PENDSV;
  //       }
  //       if (this.pendingSystick && priority === systickPriority) {
  //         return EXC_SYSTICK;
  //       }
  //       if (levelInterrupts) {
  //         for (let interruptNumber = 0; interruptNumber < 32; interruptNumber++) {
  //           if (levelInterrupts & (1 << interruptNumber)) {
  //             return 16 + interruptNumber;
  //           }
  //         }
  //       }
  //     }
  //     return 0;
  //   }
  return 0;
}

void CortexM0Core::setInterrupt(uint32_t irq, bool value) {
  // TODO(port): cortex-m0-core.ts
  //   setInterrupt(irq: number, value: boolean) {
  //     const irqBit = 1 << irq;
  //     if (value && !(this.pendingInterrupts & irqBit)) {
  //       this.pendingInterrupts |= irqBit;
  //       this.interruptsUpdated = true;
  //       if (this.waiting && this.checkForInterrupts()) {
  //         this.waiting = false;
  //         this.waitingForEvent = false;
  //       }
  //     } else if (!value) {
  //       this.pendingInterrupts &= ~irqBit;
  //     }
  //   }
  (void)irq;
  (void)value;
}

bool CortexM0Core::checkForInterrupts() {
  // TODO(port): cortex-m0-core.ts
  //   checkForInterrupts() {
  //     /* If we're waiting for an interrupt (i.e. WFI/WFE), the ARM says:
  //        > If PRIMASK.PM is set to 1, an asynchronous exception that has a higher group priority than any
  //        > active exception results in a WFI instruction exit. If the group priority of the exception is less than or
  //        > equal to the execution group priority, the exception is ignored.
  //     */
  //     const currentPriority = this.waiting
  //       ? this.PM
  //         ? this.exceptionPriority(this.IPSR)
  //         : LOWEST_PRIORITY
  //       : Math.min(this.exceptionPriority(this.IPSR), this.PM ? 0 : LOWEST_PRIORITY);
  //     const interruptSet = this.pendingInterrupts & this.enabledInterrupts;
  //     const { svCallPriority, systickPriority, pendSVPriority } = this;
  //     if (this.pendingNMI) {
  //       this.pendingNMI = false;
  //       this.exceptionEntry(EXC_NMI);
  //       return true;
  //     }
  //     for (let priority = 0; priority < currentPriority; priority++) {
  //       const levelInterrupts = interruptSet & this.interruptPriorities[priority];
  //       if (this.pendingSVCall && priority === svCallPriority) {
  //         this.pendingSVCall = false;
  //         this.exceptionEntry(EXC_SVCALL);
  //         return true;
  //       }
  //       if (this.pendingPendSV && priority === pendSVPriority) {
  //         this.pendingPendSV = false;
  //         this.exceptionEntry(EXC_PENDSV);
  //         return true;
  //       }
  //       if (this.pendingSystick && priority === systickPriority) {
  //         this.pendingSystick = false;
  //         this.exceptionEntry(EXC_SYSTICK);
  //         return true;
  //       }
  //       if (levelInterrupts) {
  //         for (let interruptNumber = 0; interruptNumber < 32; interruptNumber++) {
  //           if (levelInterrupts & (1 << interruptNumber)) {
  //             if (interruptNumber > MAX_HARDWARE_IRQ) {
  //               this.pendingInterrupts &= ~(1 << interruptNumber);
  //             }
  //             this.exceptionEntry(16 + interruptNumber);
  //             return true;
  //           }
  //         }
  //       }
  //     }
  //     this.interruptsUpdated = false;
  //     return false;
  //   }
  return false;
}

uint32_t CortexM0Core::readSpecialRegister(uint32_t sysm) {
  // TODO(port): cortex-m0-core.ts
  //   readSpecialRegister(sysm: number) {
  //     switch (sysm) {
  //       case SYSM_APSR:
  //         return this.APSR;
  //
  //       case SYSM_XPSR:
  //         return this.xPSR;
  //
  //       case SYSM_IPSR:
  //         return this.IPSR;
  //
  //       case SYSM_PRIMASK:
  //         return this.PM ? 1 : 0;
  //
  //       case SYSM_MSP:
  //         return this.SPmain;
  //
  //       case SYSM_PSP:
  //         return this.SPprocess;
  //
  //       case SYSM_CONTROL:
  //         return (this.SPSEL === StackPointerBank.SPprocess ? 2 : 0) | (this.nPRIV ? 1 : 0);
  //
  //       default:
  //         this.logger.warn(LOG_NAME, `MRS with unimplemented SYSm value: ${sysm}`);
  //         return 0;
  //     }
  //   }
  (void)sysm;
  return 0;
}

void CortexM0Core::writeSpecialRegister(uint32_t sysm, uint32_t value) {
  // TODO(port): cortex-m0-core.ts
  //   writeSpecialRegister(sysm: number, value: number) {
  //     switch (sysm) {
  //       case SYSM_APSR:
  //         this.APSR = value;
  //         break;
  //
  //       case SYSM_XPSR:
  //         this.xPSR = value;
  //         break;
  //
  //       case SYSM_IPSR:
  //         this.IPSR = value;
  //         break;
  //
  //       case SYSM_PRIMASK:
  //         this.PM = !!(value & 1);
  //         this.interruptsUpdated = true;
  //         break;
  //
  //       case SYSM_MSP:
  //         this.SPmain = value;
  //         break;
  //
  //       case SYSM_PSP:
  //         this.SPprocess = value;
  //         break;
  //
  //       case SYSM_CONTROL:
  //         this.nPRIV = !!(value & 1);
  //         if (this.currentMode === ExecutionMode.Mode_Thread) {
  //           this.switchStack(value & 2 ? StackPointerBank.SPprocess : StackPointerBank.SPmain);
  //         }
  //         break;
  //
  //       default:
  //         this.logger.warn(LOG_NAME, `MRS with unimplemented SYSm value: ${sysm}`);
  //         return 0;
  //     }
  //   }
  (void)sysm;
  (void)value;
}

void CortexM0Core::BXWritePC(uint32_t address) {
  // TODO(port): cortex-m0-core.ts
  //   BXWritePC(address: number) {
  //     if (this.currentMode == ExecutionMode.Mode_Handler && address >>> 28 == 0b1111) {
  //       this.exceptionReturn(address & 0x0fffffff);
  //     } else {
  //       this.PC = address & ~1;
  //     }
  //   }
  (void)address;
}

double CortexM0Core::substractUpdateFlags(double minuend, double subtrahend) {
  // TODO(port): cortex-m0-core.ts
  //   private substractUpdateFlags(minuend: number, subtrahend: number) {
  //     const result = minuend - subtrahend;
  //     this.N = !!(result & 0x80000000);
  //     this.Z = (result & 0xffffffff) === 0;
  //     this.C = minuend >= subtrahend;
  //     this.V =
  //       (!!(result & 0x80000000) && !(minuend & 0x80000000) && !!(subtrahend & 0x80000000)) ||
  //       (!(result & 0x80000000) && !!(minuend & 0x80000000) && !(subtrahend & 0x80000000));
  //     return result;
  //   }
  (void)minuend;
  (void)subtrahend;
  return 0;
}

double CortexM0Core::addUpdateFlags(double addend1, double addend2) {
  // TODO(port): cortex-m0-core.ts
  //   private addUpdateFlags(addend1: number, addend2: number) {
  //     const unsignedSum = (addend1 + addend2) >>> 0;
  //     const signedSum = (addend1 | 0) + (addend2 | 0);
  //     const result = addend1 + addend2;
  //     this.N = !!(result & 0x80000000);
  //     this.Z = (result & 0xffffffff) === 0;
  //     this.C = result === unsignedSum ? false : true;
  //     this.V = (result | 0) === signedSum ? false : true;
  //     return result & 0xffffffff;
  //   }
  (void)addend1;
  (void)addend2;
  return 0;
}

uint32_t CortexM0Core::cyclesIO(uint32_t addr, bool write) const {
  // TODO(port): cortex-m0-core.ts
  //   cyclesIO(addr: number, write = false) {
  //     addr = addr >>> 0;
  //     if (addr >= SIO_START_ADDRESS && addr < SIO_START_ADDRESS + 0x10000000) {
  //       return 0;
  //     }
  //     if (addr >= APB_START_ADDRESS && addr < APB_START_ADDRESS + 0x10000000) {
  //       return write ? 4 : 3;
  //     }
  //     return 1;
  //   }
  (void)addr;
  (void)write;
  return 0;
}

