depletionmode/cupc8/emu/rp2040/src/cortex-m0-core.cpp
  //     else if (opcode >> 11 === 0b10000) {
  //       const imm5 = ((opcode >> 6) & 0x1f) << 1;
  //       const Rn = (opcode >> 3) & 0x7;
  //       const Rt = opcode & 0x7;
  //       const address = this.registers[Rn] + imm5;
  //       deltaCycles += this.cyclesIO(address, true);
  //       this.writeUint16(address, this.registers[Rt]);
  //     }
  //     // STRH (register)
  //     else if (opcode >> 9 === 0b0101001) {
  //       const Rm = (opcode >> 6) & 0x7;
  //       const Rn = (opcode >> 3) & 0x7;
  //       const Rt = opcode & 0x7;
  //       const address = this.registers[Rm] + this.registers[Rn];
  //       deltaCycles += this.cyclesIO(address, true);
  //       this.writeUint16(address, this.registers[Rt]);
  //     }
  //     // SUB (SP minus immediate)
  //     else if (opcode >> 7 === 0b101100001) {
  //       const imm32 = (opcode & 0x7f) << 2;
  //       this.SP -= imm32;
  //     }
  //     // SUBS (Encoding T1)
  //     else if (opcode >> 9 === 0b0001111) {
  //       const imm3 = (opcode >> 6) & 0x7;
  //       const Rn = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = this.substractUpdateFlags(this.registers[Rn], imm3);
  //     }
  //     // SUBS (Encoding T2)
  //     else if (opcode >> 11 === 0b00111) {
  //       const imm8 = opcode & 0xff;
  //       const Rdn = (opcode >> 8) & 0x7;
  //       this.registers[Rdn] = this.substractUpdateFlags(this.registers[Rdn], imm8);
  //     }
  //     // SUBS (register)
  //     else if (opcode >> 9 === 0b0001101) {
  //       const Rm = (opcode >> 6) & 0x7;
  //       const Rn = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = this.substractUpdateFlags(this.registers[Rn], this.registers[Rm]);
  //     }
  //     // SVC
  //     else if (opcode >> 8 === 0b11011111) {
  //       this.pendingSVCall = true;
  //       this.interruptsUpdated = true;
  //     }
  //     // SXTB
  //     else if (opcode >> 6 === 0b1011001001) {
  //       const Rm = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = signExtend8(this.registers[Rm]);
  //     }
  //     // SXTH
  //     else if (opcode >> 6 === 0b1011001000) {
  //       const Rm = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = signExtend16(this.registers[Rm]);
  //     }
  //     // TST
  //     else if (opcode >> 6 == 0b0100001000) {
  //       const Rm = (opcode >> 3) & 0x7;
  //       const Rn = opcode & 0x7;
  //       const result = this.registers[Rn] & this.registers[Rm];
  //       this.N = !!(result & 0x80000000);
  //       this.Z = result === 0;
  //     }
  //     // UDF
  //     else if (opcode >> 8 == 0b11011110) {
  //       const imm8 = opcode & 0xff;
  //       this.breakRewind = 2;
  //       this.rp2040.onBreak(imm8);
  //     }
  //     // UDF (Encoding T2)
  //     else if (opcode >> 4 === 0b111101111111 && opcode2 >> 12 === 0b1010) {
  //       const imm4 = opcode & 0xf;
  //       const imm12 = opcode2 & 0xfff;
  //       this.breakRewind = 4;
  //       this.rp2040.onBreak((imm4 << 12) | imm12);
  //       this.PC += 2;
  //     }
  //     // UXTB
  //     else if (opcode >> 6 == 0b1011001011) {
  //       const Rm = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = this.registers[Rm] & 0xff;
  //     }
  //     // UXTH
  //     else if (opcode >> 6 == 0b1011001010) {
  //       const Rm = (opcode >> 3) & 0x7;
  //       const Rd = opcode & 0x7;
  //       this.registers[Rd] = this.registers[Rm] & 0xffff;
  //     }
  //     // WFE
  //     else if (opcode === 0b1011111100100000) {
  //       deltaCycles++;
  //       if (this.eventRegistered) {
  //         this.eventRegistered = false;
  //       } else {
  //         this.waiting = true;
  //         this.waitingForEvent = true;
  //       }
  //     }
  //     // WFI
  //     else if (opcode === 0b1011111100110000) {
  //       deltaCycles++;
  //       this.waiting = true;
  //     }
  //     // YIELD
  //     else if (opcode === 0b1011111100010000) {
  //       // do nothing for now. Wait for event!
  //       this.logger.info(LOG_NAME, 'Yield');
  //     } else {
  //       this.logger.warn(
  //         LOG_NAME,
  //         `Warning: Instruction at ${opcodePC.toString(16)} is not implemented yet!`,
  //       );
  //       this.logger.warn(LOG_NAME, `Opcode: 0x${opcode.toString(16)} (0x${opcode2.toString(16)})`);
  //     }
  //
  //     this.cycles += deltaCycles;
  //     return deltaCycles;
  //   }
  TODO_PORT_ABORT("cortex-m0-core.ts", "CortexM0Core::executeInstruction");
}

}  // namespace rp2040js
